diagrams/batch-pipeline.dot
digraph {
    splines  = ortho

    node [shape = box]

    top -> left  -> bottom
    top -> right -> bottom

    top    [label = "dns:example.com?TYPE=TXT\ncrud/update"]
    right  [label = "mailto:alice@example.com\nmsg/send\ncarol@example.com"]

    left   [label = "mailto:alice@example.com\nmsg/send\nbob@example.com"]
    bottom [label = "https://example.com/events\ncrud/create"]
}
